src/InformationRegisters/ГП_СчетчикиБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_СчетчикиБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетчикНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчикаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПоверки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПересчета</Name>
					<Comment>Коэффициент пересчета в кубометры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйПоказатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаХВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаГВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаКан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоДляКанализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПоказаний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтрагентИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАбонентаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетчикаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоказаний</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБудущейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетчикКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_СчетчикиБП77/Forms/ФормаЗаписи/Ext/Form/Module.bsl
// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область ОпределениеПеременных

&НаКлиенте
Перем ДоступноРедактированиеРеквизитовФормы;

#КонецОбласти // ОпределениеПеременных
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ДоступноРедактированиеРеквизитовФормы = Ложь;
    НастроитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область ОбработчикиКомандФормы

// Включает / выключает возможность редактирования формы
&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
    ДоступноРедактированиеРеквизитовФормы = НЕ ДоступноРедактированиеРеквизитовФормы;
    НастроитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область СлужебныеПроцедурыИФункции

// Выполняет настройку доступности для редактирования элементов формы
&НаКлиенте
Процедура НастроитьДоступностьЭлементовФормы()
    РедактируемыеЭлементыФормы = ПолучитьДоступныеДляРедактированияЭлементы();
    Для каждого Элемент Из РедактируемыеЭлементыФормы Цикл
        Элемент.ТолькоПросмотр = НЕ ДоступноРедактированиеРеквизитовФормы;
    КонецЦикла;
КонецПроцедуры

// Возвращаемое значение:
//  - Массив из ЭлементФормы
&НаКлиенте
Функция ПолучитьДоступныеДляРедактированияЭлементы()
    РезультатФункции = Новый Массив;

    РезультатФункции.Добавить(ЭтотОбъект.Элементы.КонтрагентКод);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ОбъектАбонентаКод);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.СчетчикКод);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.Счетчик);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.СчетчикНаименование);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДоговорКод);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ТипСчетчикаКод);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ПериодичностьПоверки);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.КоэффициентПересчета);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.МаксимальныйПоказатель);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ВидСчетчика);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.МетодРасчетаХВ);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.МетодРасчетаГВ);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.МетодРасчетаКан);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ТолькоДляКанализации);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДатаУстановки);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДатаПоверки);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ЗначенияПоказаний);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.КонтрагентИНН);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.КонтрагентНаименование);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ОбъектАбонентаНаименование);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДоговорНаименование);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДоговорНомер);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ТипСчетчикаНаименование);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДатаПоказаний);
    РезультатФункции.Добавить(ЭтотОбъект.Элементы.ДатаБудущейПоверки);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --
